Repository: stplr-dev/stplr
Catalog: internal/i18n/po/*/default.po
Languages: ru

source: Error loading config
ru: Ошибка при загрузке конфигурации

source: Error while running app
ru: Ошибка при запуске приложения

source: Command-line interface for Stapler, a universal Linux package build system
ru: Интерфейс командной строки для Stapler, универсальной системы сборки пакетов Linux

source: Stapler is a universal Linux package build and distribution system designed for cross-distribution software delivery. Packages are distributed through Stapler repositories. By default, stplr ships without any repositories configured, so you must add one or more repositories before installing software. Getting started: stplr repo add [name] [url] Add a Stapler repository stplr refresh Update repository indexes stplr install [package] Install a package from configured repositories stplr search [query] Search for packages For more information and list of community repositories: https://stplr.dev/docs/intro
ru: Stapler — универсальная система сборки и распространения пакетов для Linux, предназначенная для кросс-дистрибутивной доставки программного обеспечения. Пакеты распространяются через репозитории Stapler. По умолчанию stplr поставляется без настроенных репозиториев, поэтому перед установкой программ необходимо добавить один или несколько репозиториев. Начало работы: stplr repo add [name] [url] Добавить репозиторий Stapler stplr refresh Обновить индексы репозиториев stplr install [package] Установить пакет из настроенных репозиториев stplr search [query] Найти пакеты Для получения дополнительной информации и списка репозиториев сообщества: https://stplr.dev/docs/intro

source: Arguments to be passed on to the package manager
ru: Аргументы, которые будут переданы менеджеру пакетов

source: Enable interactive questions and prompts
ru: Включение интерактивных вопросов и запросов

source: Build a local package
ru: Сборка локального пакета

source: Path to the build script
ru: Путь к скрипту сборки

source: Specify subpackage in script (for multi package script only)
ru: Укажите подпакет в скрипте (только для многопакетного скрипта)

source: Name of the package to build and its repo (example: default/go-bin)
ru: Имя пакета для сборки и его репозиторий (пример: default/go-bin)

source: Build package from scratch even if there's an already built package available
ru: Создайте пакет с нуля, даже если уже имеется готовый пакет

source: Do not add suffix to package name
ru: Не добавлять суффикс к имени пакета

source: Manage config
ru: Управление конфигурацией

source: Show config
ru: Показать конфигурацию

source: Set config value
ru: Установить значение в конфигурации

source: <key> <value>
ru: <ключ> <значение>

source: use 'repo add/remove' commands to manage repositories
ru: используйте команды 'repo add/remove' для управления репозиториями

source: Get config value
ru: Получить значение из конфигурации

source: <key>
ru: <ключ>

source: Attempt to fix problems with Stapler
ru: Попытка устранить проблемы с Stapler

source: Unable to remove lock dir
ru: Не удалось удалить каталог блокировки

source: List all the available helper commands
ru: Список всех доступных вспомогательных команды

source: Run a Stapler helper command
ru: Запустить вспомогательную команду Staplerfile

source: The directory that the install commands will install to
ru: Каталог, в который будут устанавливать команды установки

source: No such helper command
ru: Такой вспомогательной команды нет

source: Error getting working directory
ru: Ошибка при получении рабочего каталога

source: Error parsing os-release file
ru: Ошибка при разборе файла выпуска операционной системы

source: Print information about a package
ru: Отобразить информацию о пакете

source: Show all information, not just for the current distro
ru: Показывать всю информацию, не только для текущего дистрибутива

source: Command info expected at least 1 argument, got %d
ru: Для команды info ожидался хотя бы 1 аргумент, получено %d

source: Command remove expected at least 1 argument, got %d
ru: Для команды remove ожидался хотя бы 1 аргумент, получено %d

source: Install a new package
ru: Установить новый пакет

source: List Stapler repo packages
ru: Список пакетов репозитория Stapler

source: Format output using a Go template
ru: Формат выходных данных с использованием шаблона Go

source: Migrate to current version
ru: Мигрировать до текущей версии

source: Pull all repositories that have changed
ru: Скачать все изменённые репозитории

source: Remove an installed package
ru: Удалить установленный пакет

source: Manage repos
ru: Управление репозиториями

source: Remove an existing repository
ru: Удалить существующий репозиторий

source: <name>
ru: <имя>

source: Add a new repository
ru: Добавить новый репозиторий

source: <name> <url>
ru: <имя> <url>

source: List repositories
ru: Список репозиториев

source: Output in JSON format
ru: Вывод в JSON формате

source: Set the reference of the repository
ru: Установить ссылку на версию репозитория

source: <name> <ref>
ru: <имя> <ссылка_на_версию>

source: Disable (or enable) repository
ru: Отключить (или включить) репозиторий

source: <name> <value>
ru: <имя> <значение>

source: Set the main url of the repository
ru: Установить главный URL репозитория

source: Import a repository from a stapler-repo.toml file
ru: Импортировать репозиторий из stapler-repo.toml файла

source: Import a repository using a stapler-repo.toml file. The file path can be a regular file or '-' to read from stdin.
ru: Импортировать репозиторий из stapler-repo.toml файла. Путь к файлу может быть обычным файлом или '-' для чтения из stdin.

source: <name> <file>
ru: <имя> <файл>

source: Skip pulling repository after import
ru: Пропустить загрузку репозитория после импорта

source: Skip import if repository already exists
ru: Пропустить импорт, если репозиторий уже существует

source: Manage mirrors of repos
ru: Управление зеркалами репозитория

source: Add a mirror URL to repository
ru: Добавить зеркало репозитория

source: Remove mirror from the repository
ru: Удалить зеркало из репозитория

source: Ignore if mirror does not exist
ru: Игнорировать, если зеркала не существует

source: Match partial URL (e.g., github.com instead of full URL)
ru: Соответствует частичному URL (например, github.com вместо полного URL)

source: Remove all mirrors from the repository
ru: Удалить все зеркала из репозитория

source: Search packages
ru: Поиск пакетов

source: Search by query (CEL syntax)
ru: Поиск по запросу (CEL синтаксис)

source: [DEPRECATED] Search by name
ru: [УСТАРЕЛ] Искать по имени

source: [DEPRECATED] Search by description
ru: [УСТАРЕЛ] Искать по описанию

source: [DEPRECATED] Search by repository
ru: [УСТАРЕЛ] Искать по репозиторию

source: [DEPRECATED] Search by provides
ru: [УСТАРЕЛ] Иcкать по provides

source: Dump debug information
ru: Выгрузить отладочную информацию

source: Gathers system, configuration, and log data into a diagnostic archive
ru: Собирает данные о системе, конфигурацию и логи в диагностический архив

source: Upgrade all installed packages
ru: Обновить все установленные пакеты

source: Print the current Stapler version and exit
ru: Показать текущую версию Stapler и выйти

source: Failed to get working directory
ru: Ошибка при получении рабочего каталога

source: Unable to detect a supported package manager on the system
ru: Не удалось обнаружить поддерживаемый менеджер пакетов в системе

source: Error initialization database
ru: Ошибка инициализации базы данных

source: ERROR
ru: ОШИБКА

source: q/Esc - Quit
ru: q/Esc - Выйти

source: y - Accept
ru: y - Принять

source: n/q/Esc - Decline
ru: n/q/Esc - Отклонить

source: NON-FREE SOFTWARE AGREEMENT
ru: СОГЛАШЕНИЕ О НЕСВОБОДНОМ ПО

source: Full license available at: %s
ru: Полный текст лицензии доступен по адресу: %s

source: Installing dependencies
ru: Установка зависимостей

source: Firejail is disabled for %q package due to ignore pattern %q in config. Security isolation will not be applied. Ensure you understand the risks.
ru: Firejail отключён для пакета %q из-за шаблона игнорирования %q в конфигурации. Изоляция безопасности применяться не будет. Убедитесь, что вы понимаете связанные с этим риски.

source: Your settings do not allow SKIP in checksums
ru: Ваши настройки не позволяют использовать SKIP в контрольных суммах

source: Your system's CPU architecture doesn't match this package. Do you want to build anyway?
ru: Архитектура процессора вашей системы не соответствует этому пакету. Вы все равно хотите выполнить сборку?

source: This package is already installed
ru: Этот пакет уже установлен

source: This package contains non-free software that requires license acceptance.
ru: Этот пакет содержит несвободное программное обеспечение, которое требует принятия лицензии.

source: Building the %q package
ru: Сборка пакета %q

source: The checksums array must be the same length as sources
ru: Массив контрольных сумм должен быть той же длины, что и источники

source: Downloading sources
ru: Скачивание источников

source: Would you like to remove the build dependencies?
ru: Хотели бы вы удалить зависимости сборки?

source: Would you like to view the build script for %s
ru: Показать скрипт для пакета %s

source: Would you still like to continue?
ru: Продолжить?

source: Error prompting for choice of package
ru: Ошибка при запросе выбора пакета

source: Choose which package to %s
ru: Выберите, какой пакет использовать для %s

source: Choose which optional package to install
ru: Выберите, какой дополнительный пакет следует установить

source: Error on dropping capabilities
ru: Ошибка при понижении привилегий

source: You need to be a %s member or root to perform this action
ru: Вы должны быть членом %s или root чтобы выполнить это

source: Shows a list of commands or help for one command
ru: Показывает список команд или справку по одной команде

source: Show help
ru: Показать справку

source: NAME
ru: НАЗВАНИЕ

source: USAGE
ru: ИСПОЛЬЗОВАНИЕ

source: global options
ru: глобальные опции

source: command
ru: команда

source: command options
ru: опции команды

source: arguments
ru: аргументы

source: VERSION
ru: ВЕРСИЯ

source: DESCRIPTION
ru: ОПИСАНИЕ

source: AUTHOR
ru: АВТОР

source: COMMANDS
ru: КОМАНДЫ

source: GLOBAL OPTIONS
ru: ГЛОБАЛЬНЫЕ ОПЦИИ

source: COPYRIGHT
ru: АВТОРСКОЕ ПРАВО

source: CATEGORY
ru: КАТЕГОРИЯ

source: OPTIONS
ru: ПАРАМЕТРЫ

source: Help
ru: Помощь

source: Use arrows to move
ru: Используйте стрелки для перемещения

source: space to select
ru: пробел для выбора

source: <right> to all
ru: <вправо> выбрать всё

source: <left> to none
ru: <влево> снять выбор

source: type to filter
ru: введите текст для фильтрации

source: for more help
ru: для дополнительной помощи

source: You need to be root to perform this action
ru: Вы должны быть root чтобы выполнить это

source: This action requires elevated privileges.
ru: Это действие требует повышенных привилегий.

source: Attempting to run as root using '%s'...
ru: Попытка запустить от имени root с использованием '%s'...

source: Stapler repo's minimum Stapler version is greater than the current version. Try updating Stapler if something doesn't work.
ru: Минимальная версия Stapler для репозитория выше текущей версии. Попробуйте обновить Stapler, если что-то не работает.

source: Applying FireJail integration for %q package
ru: Применение интеграции FireJail для пакета %q

source: Building metadata for package %q
ru: Сборка метаданных пакета %q

source: Executing %s()
ru: Выполнение %s()

source: Git repository does not appear to be a valid Stapler repo
ru: Git-репозиторий не выглядит корректным репозиторием Stapler

source: Pull %s
ru: Получение %s

source: Trying mirror %d: %s
ru: Пробую зеркало %d: %s

source: Error pulling repositories
ru: Ошибка при извлечении репозиториев

source: Repository pulled successfully!
ru: Репозиторий успешно извлечен!

source: Failed to pull from %s: %v
ru: Не удалось извлечь из %s: %v

source: - Pulled from %s
ru: - Получено из %s

source: 🞮 Failed to pull — the only source is unavailable
ru: 🞮 Не удалось выполнить запрос — единственный источник недоступен

source: Pulling %s...
ru: Вытягивание %s...

source: Error when building the package. Report the issue here: %s Error trace
ru: Ошибка при сборке пакета. Сообщите о проблеме здесь: %s Трассировка ошибки

source: Error moving the package
ru: Ошибка при перемещении пакета

source: Your settings do not allow build command
ru: Ваши настройки не позволяют использовать команду build

source: unknown config key: %s
ru: неизвестный ключ конфигурации: %s

source: invalid value for %s: %v
ru: неверное булево значение для %s: %v

source: failed to save config: %v
ru: не удалось сохранить конфигурацию: %v

source: Successfully set %s = %s
ru: Успешно установлено %s = %s

source: Clearing cache directory
ru: Очистка каталога кэша

source: Unable to open cache directory
ru: Невозможно открыть каталог кэша

source: Unable to read cache directory contents
ru: Невозможно прочитать содержимое каталога кэша

source: Unable to remove cache item (%s)
ru: Невозможно удалить элемент кэша (%s)

source: Rebuilding cache
ru: Восстановление кэша

source: Unable to create new cache directory
ru: Не удалось создать новый каталог кэша

source: Done
ru: Сделано

source: Error finding packages
ru: Ошибка при поиске пакетов

source: Package not found
ru: Пакет не найден

source: Error initializing resolver
ru: Ошибка инициализации resolver

source: Error encoding script variables
ru: Ошибка кодирования переменных скрита

source: Error getting packages
ru: Ошибка при получении пакетов

source: License agreement was declined
ru: Лицензионное соглашение было отклонено

source: User chose not to continue after reading script
ru: Пользователь решил не продолжать после просмотра скрипта

source: Error when installing the package. Report the issue here: %s Error trace
ru: Ошибка при установке пакета. Сообщите о проблеме здесь: %s Трассировка ошибки

source: Error when installing the package
ru: Ошибка при установке пакета

source: Error getting packages for upgrade
ru: Ошибка при получении пакетов для обновления

source: No packages for upgrade
ru: Нет пакетов к обновлению

source: Error parsing format template
ru: Ошибка при разборе шаблона

source: Error executing template
ru: Ошибка при выполнении шаблона

source: Failed to parse release
ru: Не удалось разобрать релиз

source: Error listing installed packages
ru: Ошибка при составлении списка установленных пакетов

source: Error resetting database
ru: Ошибка cброса базы данных

source: Error resetting cache
ru: Ошибка при сбросе кэша

source: Failed to reread all
ru: Не удалось перечитать всё

source: Error removing packages
ru: Ошибка при удалении пакетов

source: Repo "%s" already exists
ru: Репозиторий "%s" уже существует

source: Error saving config
ru: Ошибка при сохранении конфигурации

source: Repository %q already exists
ru: Репозиторий %q уже существует

source: Failed to read repo configuration
ru: Не удалось прочитать конфигурацию репозитория

source: Failed to import repository
ru: Не удалось импортировать репозиторий

source: Error encoding repos to JSON
ru: Ошибка при кодировании репозиториев в JSON

source: Name
ru: Имя

source: Disabled
ru: Отключен

source: Title
ru: Название

source: Summary
ru: Кратко

source: Description
ru: Описание

source: Homepage
ru: Домашняя страница

source: Icon
ru: Иконка

source: Ref
ru: Ревизия

source: Mirrors
ru: Зеркала

source: Report
ru: Сообщить об ошибке

source: No mirrors containing "%s" found in repo "%s"
ru: В репозитории "%s" не найдено зеркал, содержащих "%s"

source: URL "%s" does not exist in repo "%s"
ru: URL "%s" не существует в репозитории "%s"

source: Removed %d mirrors from repo "%s"
ru: Удалены зеркала %d из репозитория "%s"

source: Repo "%s" does not exist
ru: Репозитория "%s" не существует

source: Error removing repo directory
ru: Ошибка при удалении каталога репозитория

source: Error removing packages from database
ru: Ошибка при удалении пакетов из базы данных

source: Error while executing search
ru: Ошибка при выполнении поиска

source: Failed to generate support archive
ru: Не удалось создать архив для поддержки

source: Support archive %s has been created. You can send it to whoever needs it.
ru: Диагностический архив %s создан. Вы можете отправить его тем, кому он нужен.

source: Error checking for updates
ru: Ошибка при проверке обновлений

source: There is nothing to do.
ru: Здесь нечего делать.

source: Upgrading %d/%d: %s
ru: Обновление %d/%d: %s

source: Stopping upgrade process
ru: Остановка процесса обновления

source: Failed to upgrade %s: %v
ru: Не удалось обновить %s: %v

source: Do you want to stop the entire upgrade process?
ru: Вы хотите полностью остановить процесс обновления?

source: Continuing with next package
ru: Переходим к следующему пакету

source: Successfully upgraded %s
ru: Пакет %s успешно обновлён

source: Upgrade process interrupted
ru: Процесс обновления прерван

source: Some packages failed to upgrade
ru: Некоторые пакеты не удалось обновить

source: Successfully upgraded: %d package
ru: Успешно обновлён %d пакет

source: Failed to upgrade: %d package
ru: Не удалось обновить %d пакет

source: Source %q can be updated using %s — updating if required
ru: Источник %q можно обновить с помощью %s — обновление будет выполнено при необходимости

source: Downloading source %s from %s using %s downloader
ru: Загрузка источника %s из %s с помощью загрузчика %s

source: Source %q was updated and linked to destination
ru: Источник %q был обновлён и связан с пунктом назначения

source: Source %q found in cache and linked to destination
ru: Источник %q найден в кэше и связан с пунктом назначения

source: %s: done!
ru: %s: выполнено!

source: %s %s downloading at %s/s
ru: %s %s загружается — %s/с

source: AutoProv is not implemented for this package format, so it's skipped
ru: AutoProv не реализовано для этого формата пакета, поэтому будет пропущено

source: Provided dependency found: %s
ru: Найдена предоставленная зависимость: %s

source: Required dependency found: %s
ru: Найдена требуемая зависимость: %s

source: Command %q not found on the system
ru: Команда %q не найдена в системе

source: Can't detect system language
ru: Ошибка при определении языка системы

source: Error resolving overrides
ru: Ошибка устранения переорпеделений
